rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_SIUL2.h
#define SIUL2_GPDO161_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO161_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO161_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO161_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO161_PDO_n_SHIFT)) & SIUL2_GPDO161_PDO_n_MASK)
/*! @} */

/*! @name GPDO160 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO160_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO160_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO160_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO160_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO160_PDO_n_SHIFT)) & SIUL2_GPDO160_PDO_n_MASK)
/*! @} */

/*! @name GPDO167 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO167_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO167_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO167_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO167_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO167_PDO_n_SHIFT)) & SIUL2_GPDO167_PDO_n_MASK)
/*! @} */

/*! @name GPDO166 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO166_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO166_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO166_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO166_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO166_PDO_n_SHIFT)) & SIUL2_GPDO166_PDO_n_MASK)
/*! @} */

/*! @name GPDO165 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO165_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO165_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO165_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO165_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO165_PDO_n_SHIFT)) & SIUL2_GPDO165_PDO_n_MASK)
/*! @} */

/*! @name GPDO164 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO164_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO164_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO164_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO164_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO164_PDO_n_SHIFT)) & SIUL2_GPDO164_PDO_n_MASK)
/*! @} */

/*! @name GPDO171 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO171_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO171_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO171_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO171_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO171_PDO_n_SHIFT)) & SIUL2_GPDO171_PDO_n_MASK)
/*! @} */

/*! @name GPDO170 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO170_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO170_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO170_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO170_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO170_PDO_n_SHIFT)) & SIUL2_GPDO170_PDO_n_MASK)
/*! @} */

/*! @name GPDO169 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO169_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO169_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO169_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO169_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO169_PDO_n_SHIFT)) & SIUL2_GPDO169_PDO_n_MASK)
/*! @} */

/*! @name GPDO168 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO168_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO168_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO168_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO168_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO168_PDO_n_SHIFT)) & SIUL2_GPDO168_PDO_n_MASK)
/*! @} */

/*! @name GPDO175 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO175_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO175_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO175_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO175_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO175_PDO_n_SHIFT)) & SIUL2_GPDO175_PDO_n_MASK)
/*! @} */

/*! @name GPDO174 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO174_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO174_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO174_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO174_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO174_PDO_n_SHIFT)) & SIUL2_GPDO174_PDO_n_MASK)
/*! @} */

/*! @name GPDO173 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO173_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO173_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO173_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO173_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO173_PDO_n_SHIFT)) & SIUL2_GPDO173_PDO_n_MASK)
/*! @} */

/*! @name GPDO172 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO172_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO172_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO172_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO172_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO172_PDO_n_SHIFT)) & SIUL2_GPDO172_PDO_n_MASK)
/*! @} */

/*! @name GPDO179 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO179_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO179_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO179_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO179_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO179_PDO_n_SHIFT)) & SIUL2_GPDO179_PDO_n_MASK)
/*! @} */

/*! @name GPDO178 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO178_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO178_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO178_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO178_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO178_PDO_n_SHIFT)) & SIUL2_GPDO178_PDO_n_MASK)
/*! @} */

/*! @name GPDO177 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO177_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO177_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO177_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO177_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO177_PDO_n_SHIFT)) & SIUL2_GPDO177_PDO_n_MASK)
/*! @} */

