rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_SIUL2.h
/*! @name GPDO176 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO176_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO176_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO176_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO176_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO176_PDO_n_SHIFT)) & SIUL2_GPDO176_PDO_n_MASK)
/*! @} */

/*! @name GPDO183 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO183_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO183_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO183_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO183_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO183_PDO_n_SHIFT)) & SIUL2_GPDO183_PDO_n_MASK)
/*! @} */

/*! @name GPDO182 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO182_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO182_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO182_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO182_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO182_PDO_n_SHIFT)) & SIUL2_GPDO182_PDO_n_MASK)
/*! @} */

/*! @name GPDO181 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO181_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO181_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO181_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO181_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO181_PDO_n_SHIFT)) & SIUL2_GPDO181_PDO_n_MASK)
/*! @} */

/*! @name GPDO180 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO180_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO180_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO180_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO180_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO180_PDO_n_SHIFT)) & SIUL2_GPDO180_PDO_n_MASK)
/*! @} */

/*! @name GPDO187 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO187_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO187_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO187_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO187_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO187_PDO_n_SHIFT)) & SIUL2_GPDO187_PDO_n_MASK)
/*! @} */

/*! @name GPDO186 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO186_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO186_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO186_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO186_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO186_PDO_n_SHIFT)) & SIUL2_GPDO186_PDO_n_MASK)
/*! @} */

/*! @name GPDO185 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO185_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO185_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO185_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO185_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO185_PDO_n_SHIFT)) & SIUL2_GPDO185_PDO_n_MASK)
/*! @} */

/*! @name GPDO184 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO184_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO184_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO184_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO184_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO184_PDO_n_SHIFT)) & SIUL2_GPDO184_PDO_n_MASK)
/*! @} */

/*! @name GPDO191 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO191_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO191_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO191_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO191_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO191_PDO_n_SHIFT)) & SIUL2_GPDO191_PDO_n_MASK)
/*! @} */

/*! @name GPDO190 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO190_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO190_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO190_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO190_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO190_PDO_n_SHIFT)) & SIUL2_GPDO190_PDO_n_MASK)
/*! @} */

/*! @name GPDO189 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO189_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO189_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO189_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO189_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO189_PDO_n_SHIFT)) & SIUL2_GPDO189_PDO_n_MASK)
/*! @} */

/*! @name GPDO188 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO188_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO188_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO188_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO188_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO188_PDO_n_SHIFT)) & SIUL2_GPDO188_PDO_n_MASK)
/*! @} */

/*! @name GPDO195 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO195_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO195_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO195_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO195_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO195_PDO_n_SHIFT)) & SIUL2_GPDO195_PDO_n_MASK)
/*! @} */

/*! @name GPDO194 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO194_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO194_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO194_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO194_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO194_PDO_n_SHIFT)) & SIUL2_GPDO194_PDO_n_MASK)
/*! @} */

/*! @name GPDO193 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO193_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO193_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO193_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO193_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO193_PDO_n_SHIFT)) & SIUL2_GPDO193_PDO_n_MASK)
/*! @} */

/*! @name GPDO192 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO192_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO192_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO192_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO192_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO192_PDO_n_SHIFT)) & SIUL2_GPDO192_PDO_n_MASK)
/*! @} */

/*! @name GPDO199 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO199_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO199_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO199_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO199_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO199_PDO_n_SHIFT)) & SIUL2_GPDO199_PDO_n_MASK)
/*! @} */

/*! @name GPDO198 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO198_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO198_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO198_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO198_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO198_PDO_n_SHIFT)) & SIUL2_GPDO198_PDO_n_MASK)
/*! @} */

/*! @name GPDO197 - SIUL2 GPIO Pad Data Output */
/*! @{ */

