rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_SIUL2.h
#define SIUL2_GPDO197_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO197_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO197_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO197_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO197_PDO_n_SHIFT)) & SIUL2_GPDO197_PDO_n_MASK)
/*! @} */

/*! @name GPDO196 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO196_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO196_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO196_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO196_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO196_PDO_n_SHIFT)) & SIUL2_GPDO196_PDO_n_MASK)
/*! @} */

/*! @name GPDO203 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO203_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO203_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO203_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO203_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO203_PDO_n_SHIFT)) & SIUL2_GPDO203_PDO_n_MASK)
/*! @} */

/*! @name GPDO202 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO202_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO202_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO202_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO202_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO202_PDO_n_SHIFT)) & SIUL2_GPDO202_PDO_n_MASK)
/*! @} */

/*! @name GPDO201 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO201_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO201_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO201_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO201_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO201_PDO_n_SHIFT)) & SIUL2_GPDO201_PDO_n_MASK)
/*! @} */

/*! @name GPDO200 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO200_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO200_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO200_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO200_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO200_PDO_n_SHIFT)) & SIUL2_GPDO200_PDO_n_MASK)
/*! @} */

/*! @name GPDO207 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO207_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO207_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO207_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO207_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO207_PDO_n_SHIFT)) & SIUL2_GPDO207_PDO_n_MASK)
/*! @} */

/*! @name GPDO206 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO206_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO206_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO206_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO206_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO206_PDO_n_SHIFT)) & SIUL2_GPDO206_PDO_n_MASK)
/*! @} */

/*! @name GPDO205 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO205_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO205_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO205_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO205_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO205_PDO_n_SHIFT)) & SIUL2_GPDO205_PDO_n_MASK)
/*! @} */

/*! @name GPDO204 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO204_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO204_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO204_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO204_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO204_PDO_n_SHIFT)) & SIUL2_GPDO204_PDO_n_MASK)
/*! @} */

/*! @name GPDO211 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO211_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO211_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO211_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO211_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO211_PDO_n_SHIFT)) & SIUL2_GPDO211_PDO_n_MASK)
/*! @} */

/*! @name GPDO210 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO210_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO210_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO210_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO210_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO210_PDO_n_SHIFT)) & SIUL2_GPDO210_PDO_n_MASK)
/*! @} */

/*! @name GPDO209 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO209_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO209_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO209_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO209_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO209_PDO_n_SHIFT)) & SIUL2_GPDO209_PDO_n_MASK)
/*! @} */

/*! @name GPDO208 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO208_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO208_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO208_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO208_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO208_PDO_n_SHIFT)) & SIUL2_GPDO208_PDO_n_MASK)
/*! @} */

/*! @name GPDO215 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO215_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO215_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO215_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO215_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO215_PDO_n_SHIFT)) & SIUL2_GPDO215_PDO_n_MASK)
/*! @} */

/*! @name GPDO214 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO214_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO214_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO214_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO214_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO214_PDO_n_SHIFT)) & SIUL2_GPDO214_PDO_n_MASK)
/*! @} */

/*! @name GPDO213 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO213_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO213_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO213_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO213_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO213_PDO_n_SHIFT)) & SIUL2_GPDO213_PDO_n_MASK)
/*! @} */

/*! @name GPDO212 - SIUL2 GPIO Pad Data Output */
/*! @{ */

