rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_SIUL2.h
#define SIUL2_GPDI147_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI147_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI147_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI147_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI147_PDI_n_SHIFT)) & SIUL2_GPDI147_PDI_n_MASK)
/*! @} */

/*! @name GPDI146 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI146_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI146_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI146_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI146_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI146_PDI_n_SHIFT)) & SIUL2_GPDI146_PDI_n_MASK)
/*! @} */

/*! @name GPDI145 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI145_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI145_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI145_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI145_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI145_PDI_n_SHIFT)) & SIUL2_GPDI145_PDI_n_MASK)
/*! @} */

/*! @name GPDI144 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI144_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI144_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI144_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI144_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI144_PDI_n_SHIFT)) & SIUL2_GPDI144_PDI_n_MASK)
/*! @} */

/*! @name GPDI151 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI151_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI151_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI151_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI151_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI151_PDI_n_SHIFT)) & SIUL2_GPDI151_PDI_n_MASK)
/*! @} */

/*! @name GPDI150 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI150_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI150_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI150_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI150_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI150_PDI_n_SHIFT)) & SIUL2_GPDI150_PDI_n_MASK)
/*! @} */

/*! @name GPDI149 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI149_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI149_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI149_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI149_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI149_PDI_n_SHIFT)) & SIUL2_GPDI149_PDI_n_MASK)
/*! @} */

/*! @name GPDI148 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI148_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI148_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI148_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI148_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI148_PDI_n_SHIFT)) & SIUL2_GPDI148_PDI_n_MASK)
/*! @} */

/*! @name GPDI155 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI155_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI155_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI155_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI155_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI155_PDI_n_SHIFT)) & SIUL2_GPDI155_PDI_n_MASK)
/*! @} */

/*! @name GPDI154 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI154_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI154_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI154_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI154_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI154_PDI_n_SHIFT)) & SIUL2_GPDI154_PDI_n_MASK)
/*! @} */

/*! @name GPDI153 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI153_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI153_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI153_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI153_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI153_PDI_n_SHIFT)) & SIUL2_GPDI153_PDI_n_MASK)
/*! @} */

/*! @name GPDI152 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI152_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI152_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI152_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI152_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI152_PDI_n_SHIFT)) & SIUL2_GPDI152_PDI_n_MASK)
/*! @} */

/*! @name GPDI159 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI159_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI159_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI159_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI159_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI159_PDI_n_SHIFT)) & SIUL2_GPDI159_PDI_n_MASK)
/*! @} */

/*! @name GPDI158 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI158_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI158_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI158_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI158_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI158_PDI_n_SHIFT)) & SIUL2_GPDI158_PDI_n_MASK)
/*! @} */

/*! @name GPDI157 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI157_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI157_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI157_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI157_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI157_PDI_n_SHIFT)) & SIUL2_GPDI157_PDI_n_MASK)
/*! @} */

/*! @name GPDI156 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI156_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI156_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI156_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI156_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI156_PDI_n_SHIFT)) & SIUL2_GPDI156_PDI_n_MASK)
/*! @} */

/*! @name GPDI163 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI163_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI163_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI163_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI163_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI163_PDI_n_SHIFT)) & SIUL2_GPDI163_PDI_n_MASK)
/*! @} */

/*! @name GPDI162 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI162_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI162_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI162_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI162_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI162_PDI_n_SHIFT)) & SIUL2_GPDI162_PDI_n_MASK)
/*! @} */

/*! @name GPDI161 - SIUL2 GPIO Pad Data Input */
/*! @{ */

