rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_SIUL2.h
/*! @name GPDI176 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI176_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI176_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI176_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI176_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI176_PDI_n_SHIFT)) & SIUL2_GPDI176_PDI_n_MASK)
/*! @} */

/*! @name GPDI183 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI183_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI183_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI183_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI183_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI183_PDI_n_SHIFT)) & SIUL2_GPDI183_PDI_n_MASK)
/*! @} */

/*! @name GPDI182 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI182_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI182_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI182_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI182_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI182_PDI_n_SHIFT)) & SIUL2_GPDI182_PDI_n_MASK)
/*! @} */

/*! @name GPDI181 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI181_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI181_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI181_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI181_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI181_PDI_n_SHIFT)) & SIUL2_GPDI181_PDI_n_MASK)
/*! @} */

/*! @name GPDI180 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI180_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI180_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI180_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI180_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI180_PDI_n_SHIFT)) & SIUL2_GPDI180_PDI_n_MASK)
/*! @} */

/*! @name GPDI187 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI187_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI187_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI187_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI187_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI187_PDI_n_SHIFT)) & SIUL2_GPDI187_PDI_n_MASK)
/*! @} */

/*! @name GPDI186 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI186_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI186_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI186_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI186_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI186_PDI_n_SHIFT)) & SIUL2_GPDI186_PDI_n_MASK)
/*! @} */

/*! @name GPDI185 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI185_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI185_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI185_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI185_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI185_PDI_n_SHIFT)) & SIUL2_GPDI185_PDI_n_MASK)
/*! @} */

/*! @name GPDI184 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI184_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI184_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI184_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI184_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI184_PDI_n_SHIFT)) & SIUL2_GPDI184_PDI_n_MASK)
/*! @} */

/*! @name GPDI191 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI191_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI191_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI191_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI191_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI191_PDI_n_SHIFT)) & SIUL2_GPDI191_PDI_n_MASK)
/*! @} */

/*! @name GPDI190 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI190_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI190_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI190_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI190_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI190_PDI_n_SHIFT)) & SIUL2_GPDI190_PDI_n_MASK)
/*! @} */

/*! @name GPDI189 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI189_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI189_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI189_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI189_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI189_PDI_n_SHIFT)) & SIUL2_GPDI189_PDI_n_MASK)
/*! @} */

/*! @name GPDI188 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI188_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI188_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI188_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI188_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI188_PDI_n_SHIFT)) & SIUL2_GPDI188_PDI_n_MASK)
/*! @} */

/*! @name GPDI195 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI195_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI195_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI195_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI195_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI195_PDI_n_SHIFT)) & SIUL2_GPDI195_PDI_n_MASK)
/*! @} */

/*! @name GPDI194 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI194_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI194_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI194_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI194_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI194_PDI_n_SHIFT)) & SIUL2_GPDI194_PDI_n_MASK)
/*! @} */

/*! @name GPDI193 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI193_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI193_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI193_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI193_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI193_PDI_n_SHIFT)) & SIUL2_GPDI193_PDI_n_MASK)
/*! @} */

/*! @name GPDI192 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI192_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI192_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI192_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI192_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI192_PDI_n_SHIFT)) & SIUL2_GPDI192_PDI_n_MASK)
/*! @} */

/*! @name GPDI199 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI199_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI199_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI199_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI199_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI199_PDI_n_SHIFT)) & SIUL2_GPDI199_PDI_n_MASK)
/*! @} */

