rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_SIUL2.h
/*! @name GPDI198 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI198_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI198_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI198_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI198_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI198_PDI_n_SHIFT)) & SIUL2_GPDI198_PDI_n_MASK)
/*! @} */

/*! @name GPDI197 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI197_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI197_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI197_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI197_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI197_PDI_n_SHIFT)) & SIUL2_GPDI197_PDI_n_MASK)
/*! @} */

/*! @name GPDI196 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI196_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI196_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI196_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI196_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI196_PDI_n_SHIFT)) & SIUL2_GPDI196_PDI_n_MASK)
/*! @} */

/*! @name GPDI203 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI203_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI203_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI203_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI203_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI203_PDI_n_SHIFT)) & SIUL2_GPDI203_PDI_n_MASK)
/*! @} */

/*! @name GPDI202 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI202_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI202_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI202_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI202_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI202_PDI_n_SHIFT)) & SIUL2_GPDI202_PDI_n_MASK)
/*! @} */

/*! @name GPDI201 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI201_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI201_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI201_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI201_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI201_PDI_n_SHIFT)) & SIUL2_GPDI201_PDI_n_MASK)
/*! @} */

/*! @name GPDI200 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI200_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI200_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI200_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI200_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI200_PDI_n_SHIFT)) & SIUL2_GPDI200_PDI_n_MASK)
/*! @} */

/*! @name GPDI207 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI207_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI207_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI207_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI207_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI207_PDI_n_SHIFT)) & SIUL2_GPDI207_PDI_n_MASK)
/*! @} */

/*! @name GPDI206 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI206_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI206_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI206_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI206_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI206_PDI_n_SHIFT)) & SIUL2_GPDI206_PDI_n_MASK)
/*! @} */

/*! @name GPDI205 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI205_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI205_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI205_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI205_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI205_PDI_n_SHIFT)) & SIUL2_GPDI205_PDI_n_MASK)
/*! @} */

/*! @name GPDI204 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI204_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI204_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI204_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI204_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI204_PDI_n_SHIFT)) & SIUL2_GPDI204_PDI_n_MASK)
/*! @} */

/*! @name GPDI211 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI211_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI211_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI211_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI211_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI211_PDI_n_SHIFT)) & SIUL2_GPDI211_PDI_n_MASK)
/*! @} */

/*! @name GPDI210 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI210_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI210_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI210_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI210_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI210_PDI_n_SHIFT)) & SIUL2_GPDI210_PDI_n_MASK)
/*! @} */

/*! @name GPDI209 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI209_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI209_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI209_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI209_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI209_PDI_n_SHIFT)) & SIUL2_GPDI209_PDI_n_MASK)
/*! @} */

/*! @name GPDI208 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI208_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI208_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI208_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI208_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI208_PDI_n_SHIFT)) & SIUL2_GPDI208_PDI_n_MASK)
/*! @} */

/*! @name GPDI215 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI215_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI215_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI215_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI215_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI215_PDI_n_SHIFT)) & SIUL2_GPDI215_PDI_n_MASK)
/*! @} */

/*! @name GPDI214 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI214_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI214_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI214_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI214_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI214_PDI_n_SHIFT)) & SIUL2_GPDI214_PDI_n_MASK)
/*! @} */

