rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_SIUL2.h
/*! @name GPDI213 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI213_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI213_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI213_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI213_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI213_PDI_n_SHIFT)) & SIUL2_GPDI213_PDI_n_MASK)
/*! @} */

/*! @name GPDI212 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI212_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI212_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI212_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI212_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI212_PDI_n_SHIFT)) & SIUL2_GPDI212_PDI_n_MASK)
/*! @} */

/*! @name GPDI219 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI219_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI219_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI219_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI219_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI219_PDI_n_SHIFT)) & SIUL2_GPDI219_PDI_n_MASK)
/*! @} */

/*! @name GPDI218 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI218_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI218_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI218_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI218_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI218_PDI_n_SHIFT)) & SIUL2_GPDI218_PDI_n_MASK)
/*! @} */

/*! @name GPDI217 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI217_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI217_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI217_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI217_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI217_PDI_n_SHIFT)) & SIUL2_GPDI217_PDI_n_MASK)
/*! @} */

/*! @name GPDI216 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI216_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI216_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI216_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI216_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI216_PDI_n_SHIFT)) & SIUL2_GPDI216_PDI_n_MASK)
/*! @} */

/*! @name GPDI223 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI223_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI223_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI223_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI223_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI223_PDI_n_SHIFT)) & SIUL2_GPDI223_PDI_n_MASK)
/*! @} */

/*! @name GPDI222 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI222_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI222_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI222_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI222_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI222_PDI_n_SHIFT)) & SIUL2_GPDI222_PDI_n_MASK)
/*! @} */

/*! @name GPDI221 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI221_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI221_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI221_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI221_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI221_PDI_n_SHIFT)) & SIUL2_GPDI221_PDI_n_MASK)
/*! @} */

/*! @name GPDI220 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI220_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI220_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI220_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI220_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI220_PDI_n_SHIFT)) & SIUL2_GPDI220_PDI_n_MASK)
/*! @} */

/*! @name GPDI227 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI227_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI227_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI227_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI227_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI227_PDI_n_SHIFT)) & SIUL2_GPDI227_PDI_n_MASK)
/*! @} */

/*! @name GPDI226 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI226_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI226_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI226_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI226_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI226_PDI_n_SHIFT)) & SIUL2_GPDI226_PDI_n_MASK)
/*! @} */

/*! @name GPDI225 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI225_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI225_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI225_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI225_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI225_PDI_n_SHIFT)) & SIUL2_GPDI225_PDI_n_MASK)
/*! @} */

/*! @name GPDI224 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI224_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI224_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI224_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI224_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI224_PDI_n_SHIFT)) & SIUL2_GPDI224_PDI_n_MASK)
/*! @} */

/*! @name GPDI231 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI231_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI231_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI231_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI231_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI231_PDI_n_SHIFT)) & SIUL2_GPDI231_PDI_n_MASK)
/*! @} */

/*! @name GPDI230 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI230_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI230_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI230_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI230_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI230_PDI_n_SHIFT)) & SIUL2_GPDI230_PDI_n_MASK)
/*! @} */

/*! @name GPDI229 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI229_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI229_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI229_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI229_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI229_PDI_n_SHIFT)) & SIUL2_GPDI229_PDI_n_MASK)
/*! @} */

/*! @name GPDI228 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI228_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI228_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI228_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI228_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI228_PDI_n_SHIFT)) & SIUL2_GPDI228_PDI_n_MASK)
/*! @} */

/*! @name GPDI235 - SIUL2 GPIO Pad Data Input */
/*! @{ */

